poller.yml
config:
  target: "https://packages-acceptance.chef.io"
  defaults:
    headers:
      Authorization: 'Basic bWl4bGliLWluc3RhbGw6JW1LUHR6YlQxSkgxd20zMzNramtranMzOW9ldUZMZ1o4dk5vT2RMQlBkKVRaQUpzVVJzOXcwSGxvV1IkbDZo'
      Content-Type: 'text/plain'
  phases:
    - duration: 30
      arrivalRate: 1
  payload:
    path: "poller-payload.csv"
    fields:
      - product
      - channel
    order: sequence

scenarios:
  - flow:
    - post:
       url: /api/search/aql
       body: >
         items.find(
         {"repo": "omnibus-{{ channel }}-local"},
         {"@omnibus.project": "{{ product }}"},
         {"name": {"$nmatch": "*.metadata.json" }}
         ).include("@omnibus.version", "artifact.module.build")